app/Controllers/Admin/ReportController.php

    public function index()
    {
        $data = [
            'totalSales' => $this->orderModel->getTotalSales(),
            'totalOrders' => $this->orderModel->countAllResults(),
            'totalUsers' => $this->userModel->countAllResults(),
            'totalDrugs' => $this->drugModel->countAllResults(),
            'totalPharmacies' => $this->pharmacyModel->countAllResults(),
            'monthlySales' => $this->orderModel->getMonthlySales(),
            'topSellingDrugs' => $this->orderModel->getTopSellingDrugs(5),
            'revenueByPharmacy' => $this->orderModel->getRevenueByPharmacy(),
            'userGrowth' => $this->userModel->getUserGrowth(),
            'orderCompletionRate' => $this->orderModel->getOrderCompletionRate(),
            'averageOrderValue' => $this->orderModel->getAverageOrderValue(),
            'siteVisits' => $this->siteVisitModel->findAll(),
---
SELECT COUNT(*) AS `numrows`
FROM `orders`
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `drugs`
SELECT COUNT(*) AS `numrows`
FROM `pharmacies`
SELECT *
FROM `site_visits`

    public function generatePdfReport()
    {
        $data = [
            'totalSales' => $this->orderModel->getTotalSales(),
            'totalOrders' => $this->orderModel->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `orders`