app/Controllers/Home.php

SELECT *
FROM `drugs`
WHERE `is_featured` = 1
 LIMIT 4
SELECT *
FROM `pharmacies`
WHERE `is_featured` = 1
 LIMIT 4
SELECT *
FROM `regions`
---
    public function index()
    {
        $drugModel = new DrugModel();
        $pharmacyModel = new PharmacyModel();
        $testimonialModel = new TestimonialModel();
        $blogPostModel = new BlogPostModel();
        $regionModel = new RegionModel();
        $userDrugRecommendationModel = new UserDrugRecommendationModel();

        $data['featuredDrugs'] = $drugModel->where('is_featured', true)->findAll(4);
        $data['featuredPharmacies'] = $pharmacyModel->where('is_featured', true)->findAll(4);
        $data['testimonials'] = $testimonialModel->getTestimonialsWithUserInfo(6); // Fetch 6 testimonials for 2 carousel slides
        $data['blogPosts'] = $blogPostModel->findAll(3);
        $data['regions'] = $regionModel->findAll();