app/Models/OrderModel.php

    public function getTotalSales($pharmacyId = null)
    {
        $builder = $this->where('status', 'delivered')->selectSum('total_amount');
        if ($pharmacyId) {
            $builder->where('pharmacy_id', $pharmacyId);
        }
        return $builder->get()->getRow()->total_amount ?? 0;
---
SELECT SUM(`total_amount`) AS `total_amount`
FROM `orders`
WHERE `status` = 'delivered'

    public function getMonthlySales($pharmacyId = null)
    {
        $builder = $this->select('MONTH(created_at) as month, SUM(total_amount) as total')
                        ->where('status', 'delivered')
                        ->where('YEAR(created_at)', date('Y'));
        if ($pharmacyId) {
            $builder->where('pharmacy_id', $pharmacyId);
        }
        return $builder->groupBy('MONTH(created_at)')
                       ->orderBy('MONTH(created_at)', 'ASC')
                       ->get()
                       ->getResultArray();
---
SELECT MONTH(created_at) as month, SUM(total_amount) as total
FROM `orders`
WHERE `status` = 'delivered'
AND YEAR(created_at) = '2025'
GROUP BY MONTH(created_at)
ORDER BY MONTH(created_at) ASC

    public function getTopSellingDrugs($pharmacyId = null, $limit = 5)
    {
        $builder = $this->db->table('order_items')
                            ->select('drugs.name, SUM(order_items.quantity) as total_sales')
                            ->join('drugs', 'drugs.id = order_items.pharmacy_drug_id')
                            ->join('orders', 'orders.id = order_items.order_id')
                            ->where('orders.status', 'delivered');
        if ($pharmacyId) {
            $builder->where('orders.pharmacy_id', $pharmacyId);
        }
        return $builder->groupBy('drugs.id')
                       ->orderBy('total_sales', 'DESC')
                       ->limit($limit)
                       ->get()
                       ->getResultArray();
---
SELECT `drugs`.`name`, SUM(order_items.quantity) as total_sales
FROM `order_items`
JOIN `drugs` ON `drugs`.`id` = `order_items`.`pharmacy_drug_id`
JOIN `orders` ON `orders`.`id` = `order_items`.`order_id`
WHERE `orders`.`status` = 'delivered'
AND `orders`.`pharmacy_id` = 5
GROUP BY `drugs`.`id`
ORDER BY `total_sales` DESC
 LIMIT 5

    public function getRevenueByPharmacy()
    {
        return $this->select('pharmacies.name, SUM(orders.total_amount) as total_sales, COUNT(*) as total_orders')
                    ->join('pharmacies', 'pharmacies.id = orders.pharmacy_id')
                    ->where('orders.status', 'delivered')
                    ->groupBy('pharmacies.id')
                    ->orderBy('total_sales', 'DESC')
                    ->get()
                    ->getResultArray();
---
SELECT `pharmacies`.`name`, SUM(orders.total_amount) as total_sales, COUNT(*) as total_orders
FROM `orders`
JOIN `pharmacies` ON `pharmacies`.`id` = `orders`.`pharmacy_id`
WHERE `orders`.`status` = 'delivered'
GROUP BY `pharmacies`.`id`
ORDER BY `total_sales` DESC

    public function getAverageOrderValue($pharmacyId = null)
    {
        $builder = $this->select('AVG(total_amount) as avg_order_value')
                        ->where('status', 'delivered');
        if ($pharmacyId) {
            $builder->where('pharmacy_id', $pharmacyId);
        }
        $result = $builder->get()->getRow();
---
SELECT AVG(total_amount) as avg_order_value
FROM `orders`
WHERE `status` = 'delivered'