app/Models/TestimonialModel.php

    public function getTestimonialsWithUserInfo($limit = 3)
    {
        return $this->select('testimonials.*, testimonials.rating, users.username as user_name, users.profile_image as user_image')
                    ->join('users', 'users.id = testimonials.user_id')
                    ->orderBy('testimonials.created_at', 'DESC')
                    ->limit($limit)
                    ->find();
---
SELECT `testimonials`.*, `testimonials`.`rating`, `users`.`username` as `user_name`, `users`.`profile_image` as `user_image`
FROM `testimonials`
JOIN `users` ON `users`.`id` = `testimonials`.`user_id`
ORDER BY `testimonials`.`created_at` DESC
 LIMIT 6