app/Models/UserModel.php

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE DATE_FORMAT(created_at, "%Y-%m") = '2025-01'
---
    public function getUserGrowth()
    {
        $currentMonth = date('Y-m');
        $lastMonth = date('Y-m', strtotime('-1 month'));

        $currentMonthUsers = $this->where('DATE_FORMAT(created_at, "%Y-%m") =', $currentMonth)->countAllResults();