app/Models/UserDrugRecommendationModel.php

SELECT `drugs`.*, `user_drug_recommendations`.`recommendation_score`
FROM `user_drug_recommendations`
JOIN `drugs` ON `drugs`.`id` = `user_drug_recommendations`.`drug_id`
WHERE `user_drug_recommendations`.`user_id` = '1'
ORDER BY `user_drug_recommendations`.`recommendation_score` DESC
 LIMIT 4
---
    public function getRecommendedDrugs($userId, $limit = 4)
    {
        return $this->select('drugs.*, user_drug_recommendations.recommendation_score')
                    ->join('drugs', 'drugs.id = user_drug_recommendations.drug_id')
                    ->where('user_drug_recommendations.user_id', $userId)
                    ->orderBy('user_drug_recommendations.recommendation_score', 'DESC')
                    ->limit($limit)
                    ->find();